## 사고유형별 고통사고 통계

In [39]:
# 사용 패키지 불러오기
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [23]:
# 코랩에서 구글드라이브 마운트하여 데이터 불러오기
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [24]:
# 내 드라이브 내의 파일을 불러올 때 경로 /content/drive/My Drive/를 앞에 붙여주기
# encoding='utf-8'이 안될 때는 encoding='CP949' 사용.
monthly_traffic = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/DATA/2019 monthly teaffic.csv', encoding='CP949')
monthly_traffic.head()

  사고유형대분류 사고유형중분류 사고유형  월  사고건수  사망자수  중상자수  경상자수  부상신고자수
0    차대사람     횡단중  횡단중  1  1532    69   841   650      61
1    차대사람     횡단중  횡단중  2  1201    40   599   594      39
2    차대사람     횡단중  횡단중  3  1453    47   736   709      61
3    차대사람     횡단중  횡단중  4  1604    55   778   783      73
4    차대사람     횡단중  횡단중  5  1516    61   751   715      85

In [25]:
# 데이터 타입 확인
type(monthly_traffic)

pandas.core.frame.DataFrame

In [26]:
# 데이터 프레임 개요
monthly_traffic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 210 entries, 0 to 209
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   사고유형대분류  210 non-null    object
 1   사고유형중분류  210 non-null    object
 2   사고유형     210 non-null    object
 3   월        210 non-null    int64
 4   사고건수     210 non-null    int64
 5   사망자수     210 non-null    int64
 6   중상자수     210 non-null    int64
 7   경상자수     210 non-null    int64
 8   부상신고자수   210 non-null    int64
dtypes: int64(6), object(3)
memory usage: 14.9+ KB

In [27]:
# 컬럼 명 확인
monthly_traffic.columns

Index(['사고유형대분류', '사고유형중분류', '사고유형', '월', '사고건수', '사망자수', '중상자수', '경상자수',
       '부상신고자수'],
      dtype='object')

In [28]:
# 행의 개수와 열의 개수 출력
print(monthly_traffic.shape)

(210, 9)

In [29]:
# 컬럼별 타입, 통계값 확인
monthly_traffic.dtypes

사고유형대분류    object
사고유형중분류    object
사고유형       object
월           int64
사고건수        int64
사망자수        int64
중상자수        int64
경상자수        int64
부상신고자수      int64
dtype: object

In [30]:
# isnull()를 이용해 컬럼별 NAN 값의 개수 확인
# 만약에 있다면 제거는 monthly_traffic.dropna()
monthly_traffic.isnull().sum()

사고유형대분류    0
사고유형중분류    0
사고유형       0
월          0
사고건수       0
사망자수       0
중상자수       0
경상자수       0
부상신고자수     0
dtype: int64

In [31]:
# 내용 확인
monthly_traffic.values

array([['차대사람', '횡단중', '횡단중', ..., 841, 650, 61],
       ['차대사람', '횡단중', '횡단중', ..., 599, 594, 39],
       ['차대사람', '횡단중', '횡단중', ..., 736, 709, 61],
       ...,
       ['철길건널목', '철길건널목', '철길건널목', ..., 1, 0, 0],
       ['철길건널목', '철길건널목', '철길건널목', ..., 0, 0, 0],
       ['철길건널목', '철길건널목', '철길건널목', ..., 3, 4, 0]], dtype=object)

In [32]:
# 분포 확인
monthly_traffic.describe()

                월         사고건수  ...         경상자수      부상신고자수
count  210.000000   210.000000  ...   210.000000  210.000000
mean     6.490476  1093.333333  ...  1169.161905  113.723810
std      3.446433  1795.046438  ...  2206.423240  196.304494
min      1.000000     1.000000  ...     0.000000    0.000000
25%      3.250000    42.000000  ...    19.250000    7.000000
50%      6.500000   293.500000  ...   200.500000   25.000000
75%      9.000000  1448.500000  ...   780.750000   80.750000
max     12.000000  7806.000000  ...  9222.000000  836.000000

[8 rows x 6 columns]

In [33]:
# 요청 컬럼만 Series로 출력
monthly_traffic['사고유형중분류']

0        횡단중
1        횡단중
2        횡단중
3        횡단중
4        횡단중
       ...
205    철길건널목
206    철길건널목
207    철길건널목
208    철길건널목
209    철길건널목
Name: 사고유형중분류, Length: 210, dtype: object

In [34]:
# 행의 범위를 지정해서 출력
monthly_traffic[0:3]

  사고유형대분류 사고유형중분류 사고유형  월  사고건수  사망자수  중상자수  경상자수  부상신고자수
0    차대사람     횡단중  횡단중  1  1532    69   841   650      61
1    차대사람     횡단중  횡단중  2  1201    40   599   594      39
2    차대사람     횡단중  횡단중  3  1453    47   736   709      61

In [35]:
# 범위를 특정해서 데이터 확인
monthly_traffic.loc[:,['월', '사고건수']]

      월  사고건수
0     1  1532
1     2  1201
2     3  1453
3     4  1604
4     5  1516
..   ..   ...
205   6     1
206   7     1
207   8     1
208   9     1
209  10     2

[210 rows x 2 columns]

In [36]:
# 행과 열의 번호를 이용해 데이터에 바로 접근
# iloc[행, 열]
monthly_traffic.iloc[3]

사고유형대분류    차대사람
사고유형중분류     횡단중
사고유형        횡단중
월             4
사고건수       1604
사망자수         55
중상자수        778
경상자수        783
부상신고자수       73
Name: 3, dtype: object

In [37]:
# 표준편차 확인
monthly_traffic.std()

월            3.446433
사고건수      1795.046438
사망자수        16.758690
중상자수       509.755065
경상자수      2206.423240
부상신고자수     196.304494
dtype: float64

In [38]:
# by로 지정된 컬럼을 기준으로 정렬
# ascending = 내림차순, 오름차순 정렬
monthly_traffic.sort_values(by='월', ascending=True)

    사고유형대분류     사고유형중분류        사고유형   월  사고건수  사망자수  중상자수  경상자수  부상신고자수
0      차대사람         횡단중         횡단중   1  1532    69   841   650      61
132    차량단독          전복          전복   1    16     3     7     9       2
120    차량단독          전도          전도   1    35     5     8    12      13
156    차량단독   주/정차차량 충돌   주/정차차량 충돌   1     3     0     2     2       0
108     차대차          기타          기타   1  3359    26   923  3762     395
..      ...         ...         ...  ..   ...   ...   ...   ...     ...
166    차량단독   주/정차차량 충돌   주/정차차량 충돌  12     3     0     1     1       1
95      차대차       후진중충돌       후진중충돌  12   240     0    26   280      12
35     차대사람  길가장자리구역통행중  길가장자리구역통행중  12   223     6    60   151      16
190    차량단독        도로이탈     도로이탈 기타  12     8     1     4     3       0
143    차량단독          전복          전복  12    18     5     5    12       3

[210 rows x 9 columns]

In [50]:
# 월 별 사고건수 데이터 생성
month=monthly_traffic[['월','사고건수']]
month.head()

   월  사고건수
0  1  1532
1  2  1201
2  3  1453
3  4  1604
4  5  1516

In [54]:
# 월별 사고건수 데이터 행렬 축 변경
month.T

       0     1     2     3     4     5    ...  204  205  206  207  208  209
월        1     2     3     4     5     6  ...    3    6    7    8    9   10
사고건수  1532  1201  1453  1604  1516  1364  ...    1    1    1    1    1    2

[2 rows x 210 columns]

In [60]:
# 월 기준으로 정렬
month=month.sort_values(by = ['월','사고건수'])
month.head()

     월  사고건수
156  1     3
132  1    16
179  1    16
167  1    33
120  1    35